OpenFOAM_Maincode/tutorials/multiRegion/film/hotBoxes/0/fluid/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.23;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    film
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
